/*
4. Напишите функцию, которая воспринимает время как три целых
аргумента (часы, минуты я секунды) и возвращает количество секунд,
прошедших со времени, когда часы в последний раз показали 12.
Используйте эту функцию для вычисления интервала времени в секундах
между двумя моментами, находящимися внутри двенадцатичасового цикла.
*/ 


// #include <iostream>
// #include <cmath>

// using namespace std;

// int time(int hour, int minute, int seconds)
// {

//     18:32:42
//     float num_sec = som / dollar;
//     float amount_ruble = som / ruble;
//     cout << "Количество денег в долларах= " << amount_dollar << endl;
//     cout << "Количество денег в рублях= " << amount_ruble << endl;
//     return 0;
// }

// int main()
// {
//     exchangeRate(90, 1.01, 2000);
//     return 0;
// }